/** @type {import('next').NextConfig} */
const nextConfig = {
  reactStrictMode: true,
  i18n: {
    locales: [
      "bn",
      "en",
      "hi",
      "ta",
      "te",
      "mr", // বাংলাদেশ, ইন্ডিয়া (হিন্দি, তামিল, তেলুগু, মারাঠি)
      "ja",
      "ko",
      "zh", // জাপান, সাউথ কোরিয়া, চীন
      "ar",
      "tr",
      "fa", // মিডল ইস্ট (আরবি, তুর্কি, ফার্সি)
      "es",
      "fr",
      "de",
      "it",
      "pt", // ইউরোপ (স্প্যানিশ, ফ্রেঞ্চ, জার্মান, ইটালিয়ান, পর্তুগিজ)
      "ru",
      "uk",
      "pl", // ইস্টার্ন ইউরোপ (রাশিয়ান, ইউক্রেনিয়ান, পোলিশ)
      "nl",
      "sv",
      "no",
      "fi", // ওয়েস্টার্ন ও স্ক্যান্ডিনেভিয়া (ডাচ, সুইডিশ, নরওয়েজিয়ান, ফিনিশ)
    ],
    defaultLocale: "bn",
    localeDetection: false, // আমরা যেহেতু মিডলওয়্যারে আইপি দিয়ে ম্যানুয়ালি হ্যান্ডেল করছি, তাই এটাকে false করে দেওয়াই সেফ
  },
};

export default nextConfig;
